Improved encryption documentation
